ryanhaus/rowan-baja-daq/can-module/software/vendor/mplab/uart_base/src/packs/PIC32CM1216JH01048_DFP/component/nvmctrl.h
#define NVMCTRL_FFLTCAP_FLTADR_Pos            _UINT32_(0)                                          /* (NVMCTRL_FFLTCAP) Fault Capture Address Position */
#define NVMCTRL_FFLTCAP_FLTADR_Msk            (_UINT32_(0xFFFFFF) << NVMCTRL_FFLTCAP_FLTADR_Pos)   /* (NVMCTRL_FFLTCAP) Fault Capture Address Mask */
#define NVMCTRL_FFLTCAP_FLTADR(value)         (NVMCTRL_FFLTCAP_FLTADR_Msk & (_UINT32_(value) << NVMCTRL_FFLTCAP_FLTADR_Pos)) /* Assignment of value for FLTADR in the NVMCTRL_FFLTCAP register */
#define NVMCTRL_FFLTCAP_Msk                   _UINT32_(0x00FFFFFF)                                 /* (NVMCTRL_FFLTCAP) Register Mask  */


/* -------- NVMCTRL_FFLTPAR : (NVMCTRL Offset: 0x94) ( R/ 32) Fault parity -------- */
#define NVMCTRL_FFLTPAR_RESETVALUE            _UINT32_(0x00)                                       /*  (NVMCTRL_FFLTPAR) Fault parity  Reset Value */

#define NVMCTRL_FFLTPAR_SECIN_Pos             _UINT32_(0)                                          /* (NVMCTRL_FFLTPAR) Single Error Parity Bits Position */
#define NVMCTRL_FFLTPAR_SECIN_Msk             (_UINT32_(0xFF) << NVMCTRL_FFLTPAR_SECIN_Pos)        /* (NVMCTRL_FFLTPAR) Single Error Parity Bits Mask */
#define NVMCTRL_FFLTPAR_SECIN(value)          (NVMCTRL_FFLTPAR_SECIN_Msk & (_UINT32_(value) << NVMCTRL_FFLTPAR_SECIN_Pos)) /* Assignment of value for SECIN in the NVMCTRL_FFLTPAR register */
#define NVMCTRL_FFLTPAR_SECOUT_Pos            _UINT32_(16)                                         /* (NVMCTRL_FFLTPAR) The Calculated Single Error Parity Bits Position */
#define NVMCTRL_FFLTPAR_SECOUT_Msk            (_UINT32_(0xFF) << NVMCTRL_FFLTPAR_SECOUT_Pos)       /* (NVMCTRL_FFLTPAR) The Calculated Single Error Parity Bits Mask */
#define NVMCTRL_FFLTPAR_SECOUT(value)         (NVMCTRL_FFLTPAR_SECOUT_Msk & (_UINT32_(value) << NVMCTRL_FFLTPAR_SECOUT_Pos)) /* Assignment of value for SECOUT in the NVMCTRL_FFLTPAR register */
#define NVMCTRL_FFLTPAR_Msk                   _UINT32_(0x00FF00FF)                                 /* (NVMCTRL_FFLTPAR) Register Mask  */


/* -------- NVMCTRL_FFLTSYN : (NVMCTRL Offset: 0x98) ( R/ 32) Fault ECC syndrome -------- */
#define NVMCTRL_FFLTSYN_RESETVALUE            _UINT32_(0x00)                                       /*  (NVMCTRL_FFLTSYN) Fault ECC syndrome  Reset Value */

#define NVMCTRL_FFLTSYN_SECSYN_Pos            _UINT32_(0)                                          /* (NVMCTRL_FFLTSYN) Single Error Syndrome Position */
#define NVMCTRL_FFLTSYN_SECSYN_Msk            (_UINT32_(0xFF) << NVMCTRL_FFLTSYN_SECSYN_Pos)       /* (NVMCTRL_FFLTSYN) Single Error Syndrome Mask */
#define NVMCTRL_FFLTSYN_SECSYN(value)         (NVMCTRL_FFLTSYN_SECSYN_Msk & (_UINT32_(value) << NVMCTRL_FFLTSYN_SECSYN_Pos)) /* Assignment of value for SECSYN in the NVMCTRL_FFLTSYN register */
#define NVMCTRL_FFLTSYN_DERRSERR_Pos          _UINT32_(16)                                         /* (NVMCTRL_FFLTSYN) Double Error detected, Single error corrected Position */
#define NVMCTRL_FFLTSYN_DERRSERR_Msk          (_UINT32_(0x3) << NVMCTRL_FFLTSYN_DERRSERR_Pos)      /* (NVMCTRL_FFLTSYN) Double Error detected, Single error corrected Mask */
#define NVMCTRL_FFLTSYN_DERRSERR(value)       (NVMCTRL_FFLTSYN_DERRSERR_Msk & (_UINT32_(value) << NVMCTRL_FFLTSYN_DERRSERR_Pos)) /* Assignment of value for DERRSERR in the NVMCTRL_FFLTSYN register */
#define NVMCTRL_FFLTSYN_Msk                   _UINT32_(0x000300FF)                                 /* (NVMCTRL_FFLTSYN) Register Mask  */


/* -------- NVMCTRL_DBGCTRL : (NVMCTRL Offset: 0x9C) (R/W 8) Debug control -------- */
#define NVMCTRL_DBGCTRL_RESETVALUE            _UINT8_(0x00)                                        /*  (NVMCTRL_DBGCTRL) Debug control  Reset Value */

#define NVMCTRL_DBGCTRL_DBGECC_Pos            _UINT8_(1)                                           /* (NVMCTRL_DBGCTRL) ECC errors from debugger reads are Position */
#define NVMCTRL_DBGCTRL_DBGECC_Msk            (_UINT8_(0x3) << NVMCTRL_DBGCTRL_DBGECC_Pos)         /* (NVMCTRL_DBGCTRL) ECC errors from debugger reads are Mask */
#define NVMCTRL_DBGCTRL_DBGECC(value)         (NVMCTRL_DBGCTRL_DBGECC_Msk & (_UINT8_(value) << NVMCTRL_DBGCTRL_DBGECC_Pos)) /* Assignment of value for DBGECC in the NVMCTRL_DBGCTRL register */
#define   NVMCTRL_DBGCTRL_DBGECC_VAL_0_Val    _UINT8_(0x0)                                         /* (NVMCTRL_DBGCTRL) Corrected, INTFLAG is not updated and FLT logic is not updated  */
#define   NVMCTRL_DBGCTRL_DBGECC_VAL_1_Val    _UINT8_(0x1)                                         /* (NVMCTRL_DBGCTRL) Not corrected, INTFLAG is not updated, and FLT logic is not updated  */
#define   NVMCTRL_DBGCTRL_DBGECC_VAL_2_Val    _UINT8_(0x2)                                         /* (NVMCTRL_DBGCTRL) Corrected, INTFLAG is updated and FLT logic operates as setup  */
#define   NVMCTRL_DBGCTRL_DBGECC_VAL_3_Val    _UINT8_(0x3)                                         /* (NVMCTRL_DBGCTRL) Not corrected, INTFLAG is not updated, and FLT logic is not updated  */
#define NVMCTRL_DBGCTRL_DBGECC_VAL_0          (NVMCTRL_DBGCTRL_DBGECC_VAL_0_Val << NVMCTRL_DBGCTRL_DBGECC_Pos) /* (NVMCTRL_DBGCTRL) Corrected, INTFLAG is not updated and FLT logic is not updated Position */
#define NVMCTRL_DBGCTRL_DBGECC_VAL_1          (NVMCTRL_DBGCTRL_DBGECC_VAL_1_Val << NVMCTRL_DBGCTRL_DBGECC_Pos) /* (NVMCTRL_DBGCTRL) Not corrected, INTFLAG is not updated, and FLT logic is not updated Position */
#define NVMCTRL_DBGCTRL_DBGECC_VAL_2          (NVMCTRL_DBGCTRL_DBGECC_VAL_2_Val << NVMCTRL_DBGCTRL_DBGECC_Pos) /* (NVMCTRL_DBGCTRL) Corrected, INTFLAG is updated and FLT logic operates as setup Position */
#define NVMCTRL_DBGCTRL_DBGECC_VAL_3          (NVMCTRL_DBGCTRL_DBGECC_VAL_3_Val << NVMCTRL_DBGCTRL_DBGECC_Pos) /* (NVMCTRL_DBGCTRL) Not corrected, INTFLAG is not updated, and FLT logic is not updated Position */
#define NVMCTRL_DBGCTRL_Msk                   _UINT8_(0x06)                                        /* (NVMCTRL_DBGCTRL) Register Mask  */


/* NVMCTRL register offsets definitions */
#define NVMCTRL_CTRLA_REG_OFST         _UINT32_(0x00)      /* (NVMCTRL_CTRLA) Control A Offset */
#define NVMCTRL_CTRLB_REG_OFST         _UINT32_(0x04)      /* (NVMCTRL_CTRLB) Control B Offset */
#define NVMCTRL_PARAM_REG_OFST         _UINT32_(0x08)      /* (NVMCTRL_PARAM) NVM Parameter Offset */
#define NVMCTRL_INTENCLR_REG_OFST      _UINT32_(0x0C)      /* (NVMCTRL_INTENCLR) Interrupt Enable Clear Offset */
#define NVMCTRL_INTENSET_REG_OFST      _UINT32_(0x10)      /* (NVMCTRL_INTENSET) Interrupt Enable Set Offset */
#define NVMCTRL_INTFLAG_REG_OFST       _UINT32_(0x14)      /* (NVMCTRL_INTFLAG) Interrupt Flag Status and Clear Offset */
#define NVMCTRL_STATUS_REG_OFST        _UINT32_(0x18)      /* (NVMCTRL_STATUS) Status Offset */
#define NVMCTRL_ADDR_REG_OFST          _UINT32_(0x1C)      /* (NVMCTRL_ADDR) Address Offset */
#define NVMCTRL_LOCK_REG_OFST          _UINT32_(0x20)      /* (NVMCTRL_LOCK) Lock Section Offset */
#define NVMCTRL_PBLDATA0_REG_OFST      _UINT32_(0x28)      /* (NVMCTRL_PBLDATA0) Page Buffer Load Data 0 Offset */
#define NVMCTRL_PBLDATA1_REG_OFST      _UINT32_(0x2C)      /* (NVMCTRL_PBLDATA1) Page Buffer Load Data 1 Offset */
#define NVMCTRL_ECCCTRL_REG_OFST       _UINT32_(0x80)      /* (NVMCTRL_ECCCTRL) ECC control Offset */
#define NVMCTRL_FLTCTRL_REG_OFST       _UINT32_(0x84)      /* (NVMCTRL_FLTCTRL) Fault injection control Offset */
#define NVMCTRL_FFLTPTR_REG_OFST       _UINT32_(0x88)      /* (NVMCTRL_FFLTPTR) Fault injection pointer Offset */
#define NVMCTRL_FFLTADR_REG_OFST       _UINT32_(0x8C)      /* (NVMCTRL_FFLTADR) Fault injection address Offset */
#define NVMCTRL_FFLTCAP_REG_OFST       _UINT32_(0x90)      /* (NVMCTRL_FFLTCAP) Fault error capture addr Offset */
#define NVMCTRL_FFLTPAR_REG_OFST       _UINT32_(0x94)      /* (NVMCTRL_FFLTPAR) Fault parity Offset */
#define NVMCTRL_FFLTSYN_REG_OFST       _UINT32_(0x98)      /* (NVMCTRL_FFLTSYN) Fault ECC syndrome Offset */
#define NVMCTRL_DBGCTRL_REG_OFST       _UINT32_(0x9C)      /* (NVMCTRL_DBGCTRL) Debug control Offset */

