ryanhaus/rowan-baja-daq/can-module/software/vendor/mplab/uart_base/src/packs/PIC32CM1216JH01048_DFP/component/nvmctrl.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* NVMCTRL register API structure */
typedef struct
{  /* Non-Volatile Memory Controller */
  __IO  uint16_t                       NVMCTRL_CTRLA;      /* Offset: 0x00 (R/W  16) Control A */
  __I   uint8_t                        Reserved1[0x02];
  __IO  uint32_t                       NVMCTRL_CTRLB;      /* Offset: 0x04 (R/W  32) Control B */
  __IO  uint32_t                       NVMCTRL_PARAM;      /* Offset: 0x08 (R/W  32) NVM Parameter */
  __IO  uint32_t                       NVMCTRL_INTENCLR;   /* Offset: 0x0C (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       NVMCTRL_INTENSET;   /* Offset: 0x10 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       NVMCTRL_INTFLAG;    /* Offset: 0x14 (R/W  32) Interrupt Flag Status and Clear */
  __IO  uint16_t                       NVMCTRL_STATUS;     /* Offset: 0x18 (R/W  16) Status */
  __I   uint8_t                        Reserved2[0x02];
  __IO  uint32_t                       NVMCTRL_ADDR;       /* Offset: 0x1C (R/W  32) Address */
  __IO  uint16_t                       NVMCTRL_LOCK;       /* Offset: 0x20 (R/W  16) Lock Section */
  __I   uint8_t                        Reserved3[0x06];
  __I   uint32_t                       NVMCTRL_PBLDATA0;   /* Offset: 0x28 (R/   32) Page Buffer Load Data 0 */
  __I   uint32_t                       NVMCTRL_PBLDATA1;   /* Offset: 0x2C (R/   32) Page Buffer Load Data 1 */
  __I   uint8_t                        Reserved4[0x50];
  __IO  uint16_t                       NVMCTRL_ECCCTRL;    /* Offset: 0x80 (R/W  16) ECC control */
  __I   uint8_t                        Reserved5[0x02];
  __IO  uint16_t                       NVMCTRL_FLTCTRL;    /* Offset: 0x84 (R/W  16) Fault injection control */
  __I   uint8_t                        Reserved6[0x02];
  __IO  uint32_t                       NVMCTRL_FFLTPTR;    /* Offset: 0x88 (R/W  32) Fault injection pointer */
  __IO  uint32_t                       NVMCTRL_FFLTADR;    /* Offset: 0x8C (R/W  32) Fault injection address */
  __I   uint32_t                       NVMCTRL_FFLTCAP;    /* Offset: 0x90 (R/   32) Fault error capture addr */
  __I   uint32_t                       NVMCTRL_FFLTPAR;    /* Offset: 0x94 (R/   32) Fault parity */
  __I   uint32_t                       NVMCTRL_FFLTSYN;    /* Offset: 0x98 (R/   32) Fault ECC syndrome */
  __IO  uint8_t                        NVMCTRL_DBGCTRL;    /* Offset: 0x9C (R/W  8) Debug control */
} nvmctrl_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMJH01_NVMCTRL_COMPONENT_H_ */
